Documents/омг_УстановкаВыработки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>омг_УстановкаВыработки</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.омг_НоменклатураВыработки</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Филиалы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Филиал</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТабличнаяЧастьДолжностиИСотрудники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоменклатураИсключения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИндСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Номенклатура</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИндСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоИскл</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НоменклатураИсключения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИндСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/омг_УстановкаВыработки/Forms/ФормаПодбораНоменклатурыИФилиалов/Ext/Form/Module.bsl
&НаКлиенте
Процедура ОК(Команда)
	
	СтрВозврата = Новый Структура;
		
	МассивПозиций = Новый Массив; 
	
	Если ЭтоФилиалы Тогда
		
	Для Каждого СтрокаТаблицы Из ТабФилиалы Цикл     
		МассивПозиций.Добавить(СтрокаТаблицы);
	КонецЦикла; 
	
	Иначе	
		
	//Для Каждого СтрокаТаблицы Из ТабНоменклатура Цикл   
	//	МассивПозиций.Добавить(СтрокаТаблицы.Номенклатура);
	//КонецЦикла; 
	
    КонецЕсли;	
	СтрВозврата.Вставить("МассивПозиций",МассивПозиций);
	СтрВозврата.Вставить("ИндСтроки",ИндСтроки); 
	СтрВозврата.Вставить("ЭтоИскл",ЭтоИскл); 
	СтрВозврата.Вставить("ЭтоФилиалы",ЭтоФилиалы);
	
	Закрыть(СтрВозврата);
    
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	ИндСтроки = Параметры.ИндСтроки;
	ЭтоИскл   = Параметры.ЭтоИскл; 
	ЭтоФилиалы = Параметры.ЭтоФилиалы;  
	Организация    = Параметры.Организация;
	//Если ЭтоФилиалы Тогда
	//	Элементы.ТабНоменклатура.Видимость = Ложь;
	//	Элементы.ТабФилиалы.Видимость = Истина;
	//иначе
		//Элементы.ТабФилиалы.Видимость = Ложь;
		//Элементы.ТабНоменклатура.Видимость = Истина;
	//КонецЕсли;	
		
	Для каждого строка из Параметры.НоменклатураОтбор Цикл	
		
		//Если ЭтоФилиалы Тогда   
			
			ТабФилиалы.ЗагрузитьЗначения(Параметры.НоменклатураОтбор)
		
		//Иначе    
		//	
		//	ТабНоменклатура.ЗагрузитьЗначения(Параметры.НоменклатураОтбор)
			
		//КонецЕсли;
		
	КонецЦикла;	

КонецПроцедуры

&НаКлиенте
Процедура Подбор(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора",Истина);
	ПараметрыФормы.Вставить("МножественныйВыбор",Истина); 
    ПараметрыФормы.Вставить("ЗакрыватьПриВыборе",ложь); 
	Если ЗначениеЗаполнено(ЭтотОбъект.Организация) Тогда
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Организация",ЭтотОбъект.Организация);
	ПараметрыФормы.Вставить("ДополнительныеПараметры",ДополнительныеПараметры);
	КонецЕсли;
	ОткрытьФорму("Справочник.Филиалы.Форма.ФормаВыбораУпр",ПараметрыФормы, ЭтотОбъект);  
	
КонецПроцедуры        


&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если не ВыбранноеЗначение = Неопределено Тогда
		Для каждого строка из ВыбранноеЗначение Цикл
			
			Если  ТабФилиалы.НайтиПоЗначению(строка) = Неопределено Тогда
				ТабФилиалы.Добавить(строка)
			КонецЕсли;	
			
		КонецЦикла;	
	КонецЕсли;
	
КонецПроцедуры
